# Задание - 2
# Создайте функцию, принимающую на вход 3 числа, и возвращающую наибольшее из них

def max_of_3 (num1, num2, num3):
    return max(num1, num2, num3)


print (max_of_3(1, 2, 3))